# -*- coding: utf-8 -*-

"""
Ограничения основных видов поста
"""

FASTS = { "st" : "Строгий пост".decode('utf-8'),
           "ol" :
        "Разрешена пища с раститительным маслом".decode('utf-8'),
           "ik" : "Разрешена икра".decode('utf-8'),
           "fi" : "Разрешена рыба".decode('utf-8'),
           "mm" : "Запрет на мясо".decode('utf-8'),
           "np" : "Нет поста".decode('utf-8')
         }

def getFastName(code):
    """
    Определение типа поста
    вход: строка, код поста
    выход: строка, определение ограничений поста
    """
    return FASTS[code] if code in FASTS else ''
